# InitialIlluminanceIntensity Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
InitialIlluminanceIntensity Properties
InitialIlluminanceIntensity Class See Also
---
The InitialIlluminanceIntensity type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Distance | The illuminance intensity distance value. |
| Illuminance | The illuminance intensity value. |
| InitialIntensityValue | The calculated initial intensity value.  (Inherited from InitialIntensity.) |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from InitialIntensity.) |

# See Also
InitialIlluminanceIntensity Class
Autodesk.Revit.DB.Lighting Namespace